import logo from "/public/logo.svg";
import girl1 from "../assets/girl1.png";
import girl2 from "../assets/girl2.png";
import girl3 from "../assets/girl3.png";
import girl4 from "../assets/girl4.png";
import girl5 from "../assets/girl5.png";
import girl6 from "../assets/girl6.png";
import girl7 from "../assets/girl7.png";
import girl8 from "../assets/girl8.png";
import man1 from "../assets/man1.png";
import man2 from "../assets/man2.png";
import man3 from "../assets/man3.png";

export const Feedback = [
  // {
  //   name: "Rebehayan",
  //   job: "Web Publisher / FrontEnd Developer",
  //   message: `모든 프로젝트는 단순한 결과물이 아니라, 문제를 해결하고 새로운 가치를 창출하는 과정입니다.
  //           나와 함께한 개발자, 디자이너, 그리고 협업 파트너들의 피드백이야말로
  //           프로젝트의 성공을 증명하는 가장 강력한 이야기입니다.
  //           디자인과 기능, 사용자 경험까지 균형을 맞춘 프로젝트가 어떻게 완성되었는지,
  //           그리고 어떤 영향을 주었는지 직접 확인해보세요.`,
  //   avatar: logo,
  // },
  {
    name: "agaz***",
    job: "Web Publisher",
    message: `회사 다니면서 주말에 시간을 내서 들었는데,
    너무 유용하고 실무에도 정말 도움이 많이 됐어요!
    과제도 꽤 많아서 실제로 손에 익히는 데 큰 도움이 됐어요.
    특히 강사님이 이해하기 쉽게 잘 가르쳐 주시고,
    실무에서 바로 적용할 수 있는 팁이나 꿀정보를 아낌없이 공유해주셔서 너무 좋았어요.
    선행학습영상과 수업자료도 잘 만들어주셔서 수업시간 외에 혼자 복습하기도 좋고,
    또 과제에 대해서 피드백도 빠르고 구체적으로 주셔서 실력 향상에 정말 많은 도움이 됐어요!
    이번 강의 덕분에 자바스크립트에 대한 자신감도 생기고,
    평소 업무에서 막히던 부분들을 해결하는 데 많은 도움이 되었어요.
    그동안 들었던 이론 위주(?)의 강의들은 듣다가 포기하게 되는 경우가 많았는데
    이 강의는 강의 내용이 너무 실용적이라 바로 실무에 적용할 수 있다는 점이 가장 큰 장점인 것 같아요.
    자바스크립트를 제대로 배우고 싶은 웹퍼블리셔 분들께 진짜 추천드려요!`,
    avatar: girl1,
  },
  {
    name: "ngy1***",
    job: "Web Publisher",
    message: `이론 위주로만 설명해주는 인강과는 다르게 실무 위주로 강의가 진행되고,
    실제 프로젝트를 진행하며 배운 scss를 바로 바로 적용시킬 수 있다는게 좋았고,
    아토믹 디자인기법으로 진행되는것도 좋았습니다!
    scss뿐만 아니라 최신 css기술까지 틈틈히 알려주시고,
    질문을 하면 정말 자세히 알려주셔서 너무 좋았습니다!
    선생님한테 배울때마다 아는게 더 많아지고
    실무를 하면서도 이전과는 다르게 코드를 짜는 제 모습을 보면
    선생님께 배우길 잘했다는 생각이 항상 들어요!
    항상 잘 가르쳐주셔서 감사하고 이번에도 고생 많으셨습니당!`,
    avatar: girl2,
  },
  {
    name: "0167***",
    job: "FrontEnd Developer",
    message: `나만 알고싶을정도로 최고의 강의였습니다.
    온라인 scss 강의 결제해두고 너무 광활한 범위부터 알려줘서 쉽게 지치고 그만 뒀었는데,
    필요한 개념과 핵심을 알려주시고 실무 프로젝트 구축 위주로 알려주셔서
    이번에 제대로 scss프로젝트 작업하는 법에 대해 알게되었습니다.
    scss 외에도 제가 공부하지 않았던 업데이트 된 css 관련해서 많이 알려주셔서 추가로 크게 도움되었습니다.
    보통 본인 주장이 강한 강사님들도 있는데
    선생님은 의견을 들어주시면서 방법을 알려주셔서 정말 좋으신 분이라 생각되었습니다:)
    오프라인 강의라 비용은 조금 있었지만 비용이 전혀 아깝지 않은 강의였습니다.`,
    avatar: girl3,
  },
  {
    name: "hele***",
    job: "Web Publisher",
    message: `국비 6개월 과정을 수료하고 입사한 후,
    사수 없이 일하면서 개인 역량과 실무적인 부분에서 도움의 필요성을 느끼게 되었습니다ㅠㅠ
    입사 후 2개월 차에 너무 힘들어서,
    공부할 때 유튜브에서 알게 된 선생님이 오프라인 강의하신다는 영상보고 바로 수강신청 했습니다ㅎㅎ
    매주 과제 피드백과 제공해주시는 자료들이 실무에서도 큰 도움이 되고 있습니다.
    수업도 꼼꼼하게 진행해주시고 모르는 부분들은 모두 알려주셔서 정말 감사했습니다!`,
    avatar: girl4,
  },
  {
    name: "syon***",
    job: "Web Publisher",
    message: `퍼블리셔 3년차에 업무역량 레벨업을 고민하던 중에 듣게 된 수업입니다.
    scss에 대해 알고는 싶었으나 온라인 강의를 들어도 실무에 적용하기는 어려웠습니다.
    이 수업은 실무에 적용하고 관리하기 용이할 수 있도록 알려줘서 좋았습니다.
    기초/ 심화 나뉘어져 있어서 더 좋은것 같습니다 ^^`,
    avatar: girl5,
  },
  {
    name: "min2***",
    job: "Web Publisher",
    message: `밤늦게 질문해도 귀찮아 하지 않으시고 열정적으로 답변해주시고 하나라도 가르쳐 주려고 하시는 쌤에게 늘 감사합니다~^^
    실무자라면 꼭 들어봐야만 하는 실무중심의 강의입니다~
    단순히 문서에 나오는 nesting이나 @for문, @if조건문,@mixin 등등에 대한
    이론전달의 수업이 아닌 실무자라면 누구나 한번쯤은 고민해보고
    있을만한 내용에 대해 배우고 적용해보는 수업입니다~
    첨에 scss를 이렇게 배웠다면 더 빨리 실무에 적용해봤을텐데 아쉽더라고요~:)
    고민하신다면 시간만 늦출뿐입니다~
    정말 얻어갈게 넘쳐나는 강의라거 생각합니다~^^ 적극추천!!!강추강추!!!!`,
    avatar: girl6,
  },
  {
    name: "min2***",
    job: "Web Publisher",
    message: `국비에서 두서없이 따라치기만 하는 수업과는 달리
    개개인마다 직접 생각해보고 만들어보다보니 전체적인 구조에 대해 생각할 기회가 있어 너무 좋은거 같습니다~
    일하면서 토요일마다 10-6시까지라서 “허걱”하시며 망설이신다면 수강 고고하세요~
    생각보다 시간 잘갑니다~ 무엇보다 뭔가 토요일에 부지런히 나와서 얻어가는 느낌이 성취감 장난아닙니다~
    물론 쌤이 하나라도 더 갈쳐줄라고 노력하는 모습이 감동적입니다~
    수업시간외에도 카톡에서 늦게 막 질문해도 답변 빨리 달아주시고 열심히 할수있게 이끌어줘서 넘 좋았어요~
    전 기초반도 넘나 좋았눈데 응용반도 넘 좋았어요!!
    반응형이나 모바일~ 공통으로 사용하는 스타일 빼서 적용하는 방법 css nesting,scss맛보기,layer, 등등 많이 배웠네요~^^
    아주 작게 하나하나 분해해서 여러페이지에서 재활용하눈법도 너무 좋았습니다~^^ 감사합니당~^^`,
    avatar: girl7,
  },
  {
    name: "wvwv***",
    job: "Web Publisher",
    message: `사수가 없어서 혼자 공부를 해오다가 체계화의 필요성을 느껴 강의를 수강하게 되었습니다.
    컴포넌트화하는 방법과 간과하기 쉬운 웹표준, 접근성 지침 등을 준수하며 퍼블리싱 하는 방법을 배웠는데
    실무 하면서 답답했던 부분들이 많이 해소가 되었어요.
    매주 과제를 내주시고 과제물에 대한 피드백을 주시는데 이게 많은 도움이 됩니다.
    과제를 하다 보면 평소 코딩하는 습관이 나오는데,
    피드백을 통해 잘못된 습관을 교정하기 좋아요.
    디자인 표현하는 것에 급급하지 않고 제대로 된 퍼블리싱을 하고 싶은 분들께 강력 추천합니다.`,
    avatar: girl8,
  },
  {
    name: "bons***",
    job: "Web Publisher",
    message: `실무에서 scss를 사용했어서
    강의 전날까지 신청을 고민했었는데 듣길 너무 잘한거같아요!
    기초부터 응용까지 자세하면서도 체계적으로 가르쳐주셔서 이해가 잘 됐고,
    믹스인 활용법은 강의 신청을 고민한게 부끄러울 정도로 감격이었습니다..
    사수가 없어서 이렇게 하는게 맞나 늘 의문이었는데
    이 강의로 얻은 지식과 자료만으로도 너무 든든하네요ㅎㅎ
    정말 큰 도움이 되었습니다 좋은 강의 해주셔서 감사합니다!!`,
    avatar: man1,
  },
  {
    name: "naha***",
    job: "Designer / Web Publisher",
    message: `회사에서 디자이너로 쭉 근무하다가 개인사정으로 프리랜서로 전향하면서 퍼블리싱도 시작하게 된 케이스입니다.
    퍼블리싱 시작할때 부터 독학으로 했었는데 리베하얀님 유튜브 보면서 도움이 많이 됐었습니다.
    그러다 scss를 알게 되고 혼자서 하다보니 이해하는 부분에 어려움이 있어 좀 더 체계적인 수업을 받고싶어 신청했습니다.
    유튜브로 리베하얀님의 강의를 접해왔던지라 수업방식에 적응이 되어 수업받는 동안 조금 어렵긴했지만
    질문에 답도 바로바로 해주시고 세팅부터 차근차근 설명해 주셔서 수강하길 정말 잘했다고 셀프칭찬했습니다.
    아직 좀 더 공부해야 겠지만 기초가 잡히니 이해도가 높아지고 실무에 사용하는 방식으로 알려주셔서 훨씬 좋았습니다.`,
    avatar: man2,
  },
  {
    name: "cy***",
    job: "Web Publisher",
    message: `기초반 수업만 듣고 응용반 수업을 듣지 않으면 앙꼬 없는 붕어빵을 먹는것과 같습니다.
    제가 본 웹퍼블리셔 중 최고이시고 성실하고 책임감 있게 강의를 합니다. 감사합니다.`,
    avatar: man3,
  },
];
